* 1.1.15
** Spreadsheets Preview V4
	- Fixed a bug with row ranges not expanding properly
	- Fixed an issue with tables at the last row of the file.
	- Added random(a,b) - integer random range
	- Added randomf() - 0.0..1.0 random range
	- Range targets are now supported:

	|    a     |    b     |    c     |    d     |
	|----------+----------+----------+----------|
	| 0.506666 | 0.995246 |   0.5519 | 0.061723 |
	| 0.065874 | 0.993011 | 0.241133 | 0.410426 |
 	#+TBLFM:@2$1..@3$4=randomf()


 	- Removed some extraneous trace information.

 	| a | b | c | d | e  |
 	|---+---+---+---+----|
 	| 3 | 4 | 5 | 6 |  7 |
 	| 2 | 4 | 6 | 8 | 10 |
  	#+TBLFM:@2=$#+2::@3=$#*2